app/views/users/edit.html.slim

				- if @roles.present?
					-checked = @user.role_users.collect(&:role_id)
---
SELECT  `role_users`.* FROM `role_users` WHERE `role_users`.`user_id` = 1 AND `role_users`.`role_id` = 1 ORDER BY `role_users`.`id` DESC LIMIT 1
SELECT `roles`.* FROM `roles`