app/views/users/new.html.slim

				- if @roles.present?
					-checked = @user.role_users.collect(&:role_id)
---
SELECT `roles`.* FROM `roles`