app/controllers/roles_controller.rb

	def index
		@roles = Role.all
---
SELECT `roles`.* FROM `roles`

	def edit
		@role = Role.find(params[:id])
---
SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1

	def show
		@role = Role.find(params[:id])
---
SELECT  `roles`.* FROM `roles` WHERE `roles`.`id` = 4 LIMIT 1

	def create
		@role = Role.new(role_params)
	  if @role.save
---
INSERT INTO `roles` (`role_name`, `created_at`, `updated_at`) VALUES ('developer', '2018-05-13 06:27:49', '2018-05-13 06:27:49')