app/controllers/users_controller.rb

	def new
		@user = User.new
		@roles = Role.all
---
SELECT `roles`.* FROM `roles`

	def edit
		@user = User.find(params[:id])
		@roles = Role.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `role_users`.* FROM `role_users` WHERE `role_users`.`user_id` = 1
SELECT `roles`.* FROM `roles`

	def create
		@user = User.new(user_params)
	  if @user.save
---
INSERT INTO `role_users` (`role_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 2, '2018-05-13 06:10:03', '2018-05-13 06:10:03')
INSERT INTO `users` (`name`, `created_at`, `updated_at`) VALUES ('shalini', '2018-05-13 06:10:03', '2018-05-13 06:10:03')

	def update
		@user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `role_users`.* FROM `role_users` WHERE `role_users`.`user_id` = 1 AND `role_users`.`id` IN (1, 2, 3)